app/controllers/articles_controller.rb

  def update
    puts params.inspect
    @article = Article.find(params[:id])
    @article.update(title: params[:title], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-03-29 21:39:43.017128"], ["id", 1]]